InformationRegisters/ИнформацияОПакетахАвторабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИнформацияОПакетахАвторабот</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Представление</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПакета</Name>
					<Comment>Номер пакета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеИсполнители</Name>
					<Comment>Сотрудники в данный момент работающие над пакетом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПакетРабот</Name>
					<Comment>Пакет работ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИнформацияОПакетахАвторабот/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Пытается получить данные пустого пакета из регистра информации.
// Если не удасться найти информацию в регистре создает запись со значениями по умолчанию
//
Функция ИнформацияПоПустомуПакету() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИнформацияОПакете = РегистрыСведений.ИнформацияОПакетахАвторабот.СоздатьМенеджерЗаписи();
	ИнформацияОПакете.ПакетРабот = "00000000-0000-0000-0000-000000000000";
	ИнформацияОПакете.Прочитать();
	
	Если ИнформацияОПакете.Выбран() Тогда
		ПустойПакетИнфо = Новый Структура("ПакетРабот,Представление,НомерПакета,ТекущиеИсполнители,НомерКартинкиСостоянияПакетаРабот,СтатусПакета");
		ЗаполнитьЗначенияСвойств(ПустойПакетИнфо, ИнформацияОПакете);
		ПустойПакетИнфо.НомерКартинкиСостоянияПакетаРабот = 3;
		ПустойПакетИнфо.СтатусПакета                      = Справочники.ВидыСостоянийПакетовРабот.НеСтартовал;
	Иначе
		ИнформацияОПакете.ПакетРабот         = "00000000-0000-0000-0000-000000000000";
		ИнформацияОПакете.Представление      = "Вне пакетов";
		ИнформацияОПакете.НомерПакета        = 0;
		ИнформацияОПакете.ТекущиеИсполнители = "";
		ИнформацияОПакете.Записать(Истина);
		
		ПустойПакетИнфо = Новый Структура("ПакетРабот,Представление,НомерПакета,ТекущиеИсполнители,НомерКартинкиСостоянияПакетаРабот,СтатусПакета");
		ЗаполнитьЗначенияСвойств(ПустойПакетИнфо, ИнформацияОПакете);
		ПустойПакетИнфо.НомерКартинкиСостоянияПакетаРабот = 3;
		ПустойПакетИнфо.СтатусПакета                      = Справочники.ВидыСостоянийПакетовРабот.НеСтартовал;
	КонецЕсли;
	
	Возврат ПустойПакетИнфо;
	
КонецФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
